import { HttpClient } from '@angular/common/http';
import { Injectable } from '@angular/core';

/*
  Generated class for the ToursProvider provider.

  See https://angular.io/guide/dependency-injection for more info on providers
  and Angular DI.
*/
@Injectable()
export class ToursProvider {
  data: any;
  constructor(public http: HttpClient) {
    this.data=[
      {
        id:1,
        type: 1,
        name: "วังสวนบ้านแก้ว",
        detail: "พระราชฐานส่วนพระองค์ สมเด็จพระนางเจ้ารำไพพรรณี และพระราชทานนามสถานที่แห่งนี้ตามชื่อคลองว่า สวนบ้านแก้ว",
        image: "http://www.eculture.rbru.ac.th/img-uploads/img-1-file03-2015-09-29-10-43-32.jpg",
        showdetail: "พระองค์ทรงมีพระราชดำริที่จะหาที่ดินเพื่อสร้างพระตำหนักที่ประทับสำหรับพักผ่อนพระ ราชอิริยาบถและทรงเยี่ยมราษฎรในจังหวัดนั้น สมเด็จพระนางเจ้ารำไพพรรณีฯ มีพระราชดำริไว้ 2 แห่ง คือ ที่จังหวัดเชียงใหม่ และจังหวัดจันทบุรี แต่ที่สุดแล้วก็เลือกจันทบุรี\r\n\r\nเมื่อสมเด็จพระนางเจ้ารำไพพรรณีฯ ได้อัญเชิญพระบรมอัฐิของพระบาทสมเด็จพระปกเกล้าเจ้าอยู่หัวจากประเทศอังกฤษ กลับสู่ประเทศไทย ในพุทธศักราช 2492 นั้น รัฐบาลได้ใช้พระตำหนักวังสุโขทัยเป็นสถานที่ทำงานของกระทรวงสาธารณสุข สมเด็จพระศรีนครินทราบรมราชชนนีจึงได้เชิญเสด็จสมเด็จพระนางเจ้ารำไพพรรณีฯ ไปประทับ ณ พระตำหนักของสมเด็จพระมหิตลาธิเบศร อดุลยเดชวิกรม พระบรมราชชนก ในวังสระปทุม ระหว่างนั้นเป็นเวลาที่สมเด็จพระเจ้าลูกเธอ และสมเด็จพระเจ้าลูกยาเธอในรัชกาลปัจจุบันยังทรงพระเยาว์อยู่ สมเด็จพระนางเจ้ารำไพพรรณีฯ จึงทรงบำเพ็ญพระราชกรณียกิจแทนพระองค์ ผ่อนคลายพระราชภารกิจในพระบาทสมเด็จพระเจ้าอยู่หัวรัชกาลปัจจุบันเป็นอันมาก และเนื่องจากทรงมีพระราชหฤทัยที่อ่อนโยน ไม่ต้องพระราชประสงค์ที่จะทรงรบกวนสมเด็จพระศรีนครินทราบรมราชชนนีในการ ประทับ ณ พระตำหนักวังสระปทุมนานเกินควรอีกทั้งทรงมีพระราชประสงค์ที่จะประทับในต่าง จังหวัด ด้วยโปรดธรรมชาติและการทำสวน จึงมีพระราชดำริที่จะหาที่ดินเพื่อสร้างพระตำหนักที่ประทับสำหรับพักผ่อนพระ ราชอิริยาบถและทรงเยี่ยมราษฎรในจังหวัดนั้น",
      },
      {
        id:2,
        type: 1,
        name: "ศาลหลักเมืองจันทบุรี",
        detail: "ศาลหลักเมืองแห่งนี้ไม่ปรากฏหลักฐานว่าสร้างขึ้นเมื่อใด มีเพียงการสันนิษฐานว่า สมเด็จพระเจ้าตากสินมหาราชทรงสร้างขึ้นเมื่อครั้งเสด็จเข้าเมืองจันทบุรี",
        image: "http://wunca.uni.net.th/wunca35/slim/img/moon.png",
        showdetail: "ศาลหลักเมืองจันทบุรี ตั้งอยู่ที่ถนนท่าหลวง อำเภอเมือง จังหวัดจันทบุรี โดยอยู่ด้านหน้าค่ายตากสิน ศาลหลักเมืองแห่งนี้ไม่ปรากฏหลักฐานว่าสร้างขึ้นเมื่อใด และใครเป็นผู้สร้าง มีเพียงการสันนิษฐานว่า สมเด็จพระเจ้าตากสินมหาราชทรงสร้างขึ้นเมื่อครั้งเสด็จเข้าเมืองจันทบุรี เพื่อใช้เป็นที่รวบรวมไพร่พลและเสบียงอาหารก่อนยกทัพไปกอบกู้กรุงศรีอยุธยา ตามหนังสือพระราชประวัติสมเด็จพระเจ้าตากสินมหาราชกล่าวไว้ว่า พระองค์ทรงได้เมืองจันทบุรีจันทบุรีเมื่อวันอาทิตย์ แรม 3 ค่ำ เดือน 7 ปีกุน นพศก จุลศักราช 1129 ซึ่งตรงกับวันที่ 14 มิถุนายน พ.ศ. 2310 หากข้อสันนิษฐานดังกล่าวเป็นเรื่องจริงแล้ว ก็อาจสรุปได้ว่า ศาลหลักเมืองจันทบุรีคงสร้างขึ้นในราว พ.ศ. 2310 นั่นเอง\r\n\r\nอย่างไรก็ตาม ศาลหลักเมืองที่เห็นอยู่ในปัจจุบัน ไม่ใช่หลังเดียวกันกับที่สมเด็จพระเจ้าตากสินมหาราชทรงสร้างขึ้นเมื่อประมาณ 250 ปีที่แล้ว โดยศาลเดิมน่าจะสร้างด้วยศิลาแลงซึ่งยังปรากฏร่องรอยให้เห็นอยู่ในสภาพที่ทรุดโทรมมาก มีต้นโพธิ์และต้นข่อยขึ้นปกคลุมจนแทบไม่เหลือเค้าเดิม\r\n\r\nสำหรับตัวศาลหลักเมืองในปัจจุบัน แต่เดิมเป็นศาลไม้รูปทรงธรรมดา ตั้งอยู่ระหว่างต้นข่อยใหญ่ 2 ต้น ต่อมาในปี พ.ศ. 2524 ทางจังหวัดจันทบุรีได้ก่อสร้างศาลฝังเสาหลักเมืองและหล่อองค์เจ้าพ่อขึ้นใหม่ มีลักษณะเป็นอาคารทรงไทยแบบจัตุรมุข ก่ออิฐถือปูน มีช่อฟ้าใบระกา และมีปรางค์ที่ด้านบน นอกจากนั้น บริเวณใกล้ๆ กันกับศาลหลักเมือง ยังได้สร้างศาลขนาดเล็กที่สวยงามในแบบสถาปัตยกรรมจีนขึ้นอีกด้วย ส่งให้ศาลหลักเมืองดูสง่างามเพิ่มขึ้นไปอีก ทั้งนี้ หากคุณมีโอกาสได้มาเยือนจังหวัดจันทบุรีแล้วล่ะก็ อย่าลืมแวะมาสักการะสิ่งศักดิสิทธิ์ประจำเมืองจันท์ ณ ศาลหลักเมืองแห่งนี้",      
      },
    ];
  }

  loadAll(){
    return Promise.resolve(this.data);
  }

  getByID(code){     
    for(var i=0; i<(this.data).length; i++){      
      if(this.data[i].id == code){        
        return Promise.resolve(this.data[i]);      
      }    
    } 
  }
}
